{
    "questionHtml": "<b>Web pages are created using HTML and CSS. What do these languages do?</b>",
    "html1": "HTML is used to establish a page's structure. It also lets us add text, links and images <br/> CSS is used to control the design and layout of the page <br /> HTML stands for HyperText Markup Language. The HyperText part refers to the fact that HTML allows you to create links that allow visitors to move from one page to another quickly and easily. A Markup language allows you to annotate text, and these annotations provides additional meaning to the contents of a document. We add code around the original text we want to display and the browser then uses the code to display the page correctly. So the tags we add are the markup. <br /> HTML5 is a W3C specification that defines the fifth major revision of the Hypertext Markup Language (HTML). One of the major changes in HTML5 is in respect to how HTML addresses Web applications.",

    "htmlElements1": "HTML elements are the building blocks of web pages <br /> HTML elements describe each piece of content on a web page so that the web browser knows how to display it. <br /> HTML elements are usually made up of two <b> tags </b>: an opening tag and a closing tag. <br /> Each HTML element tells the browser something about the information that sits between its opening and closing tags. <br /> Opening tags can carry attributes, which tell us more about the content of that element.",

    "attribute1": "Attributes provide additional information about the contents of an element. They appear on the opening tag of the element and are made up of two parts: a <b>name </b> and a <b> value </b>, separated by an equals sign. <br /> Attributes require a <b> name </b> and <b> value </b>.",

    "css1": "A web page is a collection of HTML elements. CSS is used to control the appearance of an HTML element.",

    "css2": "HTML is used to write a web page's content. CSS is used to define the design and layout of the page",

    "css3": "<b> CSS Rules </b>",

    "css4": "CSS uses <b> rules </b>to style HTML elements. Here's how CSS rules work: <br /> A CSS rule starts with a <b> selector </b>. A selector specifies which HTML elements to style. Here the <b> h1 </b> CSS selector selects all <b> h1 </b>HTML elements on the page. <br /> Inside the braces <b> { } </b>, a <b> property </b>and its value define what aspect of the h1 elements to style. Setting the color property to <b> red </b>changes the color of the <b> h1 </b>element to red. Together, a selector and its property-value pairs are called <b> CSS rule </b>",

    "classAttribute1": "HTML elements can be CSS selectors, but they're not the only selectors available. Another available selector is the <b> class selector. </b>",

    "classAttribute2": "<b> Class Selector </b>",

    "classAttribute3": "The <b> class </b>can be targeted from CSS by using a dot <b>(.)</b>, as seen in the CSS <br /> The <b>.header</b> selector applies to a grouping  elements nested inside class=\"header\" <br /> In this way, classes are useful to specifically target groups of HTML elements. ",

    "classAttribute4": "<b> Combining Selectors </b>",

    "classAttribute5": "It's possible to be even more specific by combining classes and element names. <br /> This CSS selector selects any <b> p </b>element nested inside an HTML element with the class named <b> header</b>, and colors it blue. <br /> In this way, a CSS rule targets specific HTML elements on the page and applies a style to them.",

    "color1": "<b> Color </b>",

    "color2": "The <b> color </b> property sets the color of an HTML element's text. <br /> We can use color names to change the text's color. But this only works for 140 colors. <br /> Instead, we can use <b> RGB values or hexadecimal numbers. </b> They can represent millions of colors. RGB values and hex numbers express colors as different amounts of red, green and blue.",

    "fontFamily1": "<b> Font-family </b>",

    "fontFamily2": "The <b> Font-Family </b> property sets the font of an HTML element's text. <br /> Three fonts commonly used with <b>  font-family </b> are: <br /> <b>font-family: Arial, Helvetica, sans-serif; <br /> font-family: \"Times New Roman\", Times, serif; <br /> font-family: \"Courier New\" , Courier, monospace; </b> <br /> Google Fonts is a free collection of over 600 more web fonts that we can use on our page.",

    "fontSize1": "<b> Font-size </b>",

    "fontSize2": "The <b> font-size </b> property sets the size of an HTML element's text. <br /> Text size can be measured in <b> pixels, ems, </b> or <b> rems. </b>",

    "borderPaddingMargin1": "<b> Border Padding Margin: </b>",

    "borderPaddingMargin2": "The <b> border </b>  property sets the width, styles, and color of an element's border. <br /> The <b> padding </b> property creates space between the content and border of an element. This whitespace is useful in order to improve readability and organization of the page. <br /> The <b> padding </b>  property sets the padding on all sides. It's possible to set the padding on each side. <br /> The properties <b> padding-top, padding-bottom, padding-left,  </b> and <b> padding-right </b> are available to set the padding on each side of an HTML element. <br /> The <b> margin </b> property creates space for multiple HTML elements. The margin is a transparent area outside the border of an element. <br /> The <b> margin </b> property sets the margin on all side. It's possible to set the margin on each side. <br /> The properties <b>  margin-top, margin-bottom, margin-left, </b> and <b> margin-right </b> are available to set the margin on each side of an HTML element. <br /> The properties <b>  margin-left, </b> and <b> margin-right </b> are available to set the <b> margin  </b> on either side of an HTML element. If one of these properties is set to <b> auto </b>, then it will take as much as possible. <br /> To move the HTML element to the far left of the screen, use <b> margin-right: auto.</b> This will maximize the amount of space there is on the right side margin, pushing the element to the far left. <br /> To center an element, <b> set margin-right: auto </b> and <b> margin-left: auto. </b> The margin to the left and right will be equal and the element will be centered."
}